       77 WRK-VENDAS       PIC 9(06)V99     VALUE ZEROS.
       77 WRK-QT           PIC 9(03)        VALUE ZEROS.
       77 WRK-ACUM         PIC 9(06)        VALUE ZEROS.
       77 WRK-ACUM-ED      PIC ZZZZZ9       VALUE ZEROS.
       77 WRK-PREC         PIC 9(06)V99     VALUE ZEROS.
       77 WRK-PRECOACM    PIC  9(06)V99    VALUE ZEROS.
       77 WRK-PRECOFINAL   PIC 9(06)V99 VALUE ZEROS.
       77 WRK-PRECOFINAL-ED  PIC $ZZZZZ9,99   VALUES ZEROS.
