       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXPROGCOB02.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = LUCAS FARIA LURF
      * OBJETIVO: RECEBER E IMPRIMIR UMA STRING
      * DATA 08/06/2022
      ********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-IDADE PIC 9(2) VALUE ZEROS.
       77 WRK-NOVAIDADE PIC 9(2) VALUE ZEROS.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       PROCEDURE DIVISION.
       DISPLAY 'OLÁ, COMO É SEU NOME?'.
       ACCEPT WRK-NOME FROM CONSOLE.
       DISPLAY WRK-NOME 'QUAL A SUA IDADE? '
       ACCEPT WRK-IDADE FROM CONSOLE.
       ADD WRK-IDADE 20 GIVING WRK-NOVAIDADE.
       DISPLAY 'SENHOR(A) ' WRK-NOME 'VOCÊ TERÁ ' WRK-NOVAIDADE.
       DISPLAY 'DAQUI 20 ANOS'.
