       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = LUCAS FARIA LURF
      * OBJETIVO: MOSTAR A STRING HELLO COBOL
      * DATA 08/06/2022
      ********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO COBOL'.
           STOP RUN.
