       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB15.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = LUCAS FARIA LURF
      * OBJETIVO: RECEBER VENDAS ATÉ PARAR
      * UTILIZAR COMANDOS PERFORM - UNTIL
      * UTILIZAR COPY NAS VARIAVEIS
      * DATA 08/06/2022
      ********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY 'BOOK.COB'.
       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-VENDAS > 0
               PERFORM 0200-PROCESSAR UNTIL WRK-VENDAS = 0
           END-IF.
           PERFORM 0300-FINALIZAR.

       0100-INICIALIZAR.
           PERFORM 0101-COLETARQUANTIDADE.
           IF WRK-VENDAS > 0
               PERFORM 0102-COLETARPRECO
               PERFORM 0201-PROCESSAVALOR
               ADD WRK-PRECOACM TO WRK-PRECOFINAL
           END-IF.

       0101-COLETARQUANTIDADE.
      *********COLETA DE QUANTIDADE****************
           DISPLAY "DIGITE UM NUMERO".
           ACCEPT WRK-VENDAS.


       0102-COLETARPRECO.
               DISPLAY "DIGITE O VALOR".
               ACCEPT WRK-PREC.


       0200-PROCESSAR.
      ***********CALCULO DA MULTIPLICAÇÃO ***********
           ADD 1 TO WRK-QT.
           ADD WRK-VENDAS TO WRK-ACUM.


           PERFORM 0100-INICIALIZAR.
       0201-PROCESSAVALOR.
           COMPUTE WRK-PRECOACM = (WRK-VENDAS * WRK-PREC).

      **********TESTE IF PARA VER APROVAÇÃO ****
       0300-FINALIZAR.
           MOVE WRK-ACUM TO WRK-ACUM-ED.
           MOVE WRK-PRECOFINAL TO WRK-PRECOFINAL-ED.
           DISPLAY "MUITO OBRIGADO POR UTILIZAR O PROGRAMA".
           DISPLAY "CARRINHO COM: " WRK-ACUM-ED " ITENS".
           DISPLAY "O VALOR TOTAL DA COMPRA É:" WRK-PRECOFINAL-ED.
           PERFORM 0500-CRIARLINHAS.
           DISPLAY "FINAL DE PROCESSAMENTO".
           STOP RUN.

       0500-CRIARLINHAS.
           DISPLAY "===============".
