       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB13.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = LUCAS FARIA LURF
      * OBJETIVO: RECEBER 1 NUMERO E IMPRIMIR SUA TABUADA
      * UTILIZAR COMANDOS PERFORM TIMES
      * DATA 08/06/2022
      ********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUMERO PIC 9(02) VALUE ZEROS.
       77 WRK-CONTADOR PIC 9(02) VALUE 1.
       77 WRK-RESUL PIC 9(02) VALUE ZEROS.
       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0100-INICIALIZAR.
           IF WRK-NUMERO > 0
               PERFORM 0200-PROCESSAR
           END-IF.
           PERFORM 0300-FINALIZAR.

       0100-INICIALIZAR.
      *********COLETA DE NUMERO****************
       DISPLAY "DIGITE UM NUMERO"
       ACCEPT WRK-NUMERO.

       0200-PROCESSAR.
      ***********CALCULO DA MULTIPLICAÇÃO ***********
           PERFORM 10 TIMES
               COMPUTE WRK-RESUL = WRK-NUMERO * WRK-CONTADOR
               DISPLAY WRK-NUMERO " x " WRK-CONTADOR ' = ' WRK-RESUL
               ADD 1 TO WRK-CONTADOR
           END-PERFORM.


      **********TESTE IF PARA VER APROVAÇÃO ****
       0300-FINALIZAR.
           DISPLAY "MUITO OBRIGADO POR UTILIZAR O PROGRAMA".
           DISPLAY "FINAL DE PROCESSAMENTO".
           STOP RUN.
