       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB02.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = LUCAS FARIA LURF
      * OBJETIVO: RECEBER E IMPRIMIR UMA STRING
      * DATA 08/06/2022
      ********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.

       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
           DISPLAY 'OLÁ, ' WRK-NOME(1:10).
           STOP RUN.
